sample_1 데이터프레임 변수명으로 sample_1.xisx 데이터 읽어들인 후 조회하기

In [1]:
import pandas as pd

In [91]:
sample_1 = pd.read_excel('C:/Study/Study_Python2/파이썬/files/sample_1.xlsx', header=1, skipfooter=2, usecols= 'A:C' )

In [92]:
sample_1.head(3)

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319

In [93]:
sample_1.tail(3)

  국적코드  성별    입국객수
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [94]:
sample_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [95]:
sample_1.describe()

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

국적코드와 입국객수 컬럼의 값 조회하기

In [96]:
sample_1[['국적코드']]

  국적코드
0  A01
1  A01
2  A31
3  A31
4  A18
5  A18

기준년월 이라는 컬럼을 만들고 값은 모두 2019-11로 넣어주세요

In [97]:
sample_1['기준연월'] = '2019-11'
sample_1

  국적코드  성별    입국객수     기준연월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

필터링 / 성별이 남성인 데이터만 조회하기

In [98]:
sample_1[sample_1['성별']=='남성']

  국적코드  성별    입국객수     기준연월
0  A01  남성  106320  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11

In [99]:
[sample_1['성별']=='남성']

[0     True
 1    False
 2     True
 3    False
 4     True
 5    False
 Name: 성별, dtype: bool]

입국객수가 150000 이상인 데이터만 조회하기

In [100]:
sample_1[sample_1['입국객수'] >=150000]

  국적코드  성별    입국객수     기준연월
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

성별이 여성이고, 입국객수가 150000이상인 데이터만 조회하기

In [101]:
sample_1[(sample_1['성별'] =='여성') & (sample_1['입국객수'] >=150000)]

  국적코드  성별    입국객수     기준연월
1  A01  여성  191436  2019-11
5  A18  여성  232943  2019-11

국적코드의 값이 A01 또는 A18인 데이터만 조회하기

In [102]:
sample_1[(sample_1['국적코드'] == 'A01') | (sample_1['국적코드'] == 'A18')]

  국적코드  성별    입국객수     기준연월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

isin()함수 : 값의 컬럼내에 여러개 값이 포함되어 있는지 확인할 때 사용.

In [103]:
sample_1[sample_1['국적코드'].isin(['A01','A18'])]

  국적코드  성별    입국객수     기준연월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [104]:
sample_1[(sample_1['국적코드'].isin(['A01','A18']))==False]

  국적코드  성별  입국객수     기준연월
2  A31  남성   319  2019-11
3  A31  여성    42  2019-11

### 국적코드표 데이터 읽어들이기

sample_codemaster.xisx 파일 읽어들인 후 조회하기

In [105]:
# 데이터프레임변수 : code_master 

code_master = pd.read_excel('C:/Study/Study_Python2/파이썬/files/sample_codemaster.xlsx')
code_master

  국적코드     국적명
0  A01      일본
1  A02      대만
2  A03      홍콩
3  A18      중국
4  A19      이란
5  A22  우즈베키스탄
6  A23   카자흐스탄
7  A99  아시아 기타

원본에 국적명 통합하기...merge()

In [106]:
pd.merge(sample_1, code_master)

  국적코드  성별    입국객수     기준연월 국적명
0  A01  남성  106320  2019-11  일본
1  A01  여성  191436  2019-11  일본
2  A18  남성  158912  2019-11  중국
3  A18  여성  232943  2019-11  중국

In [107]:
pd.merge(left = sample_1,
          right = code_master,
          how = 'inner',
          left_on = '국적코드',
          right_on = '국적코드')

  국적코드  성별    입국객수     기준연월 국적명
0  A01  남성  106320  2019-11  일본
1  A01  여성  191436  2019-11  일본
2  A18  남성  158912  2019-11  중국
3  A18  여성  232943  2019-11  중국

In [108]:
pd.merge(sample_1, code_master, how = 'left')

  국적코드  성별    입국객수     기준연월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국

In [109]:
pd.merge(left = sample_1,
          right = code_master,
          how = 'left',
          left_on = '국적코드',
          right_on = '국적코드')

  국적코드  성별    입국객수     기준연월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국

In [110]:
# 데이터변수명 sample_2

sample_2 = pd.read_excel('C:/Study/Study_Python2/파이썬/files/sample_2.xlsx', header=1, skipfooter=2, usecols='A:C')

In [112]:
sample_2['기준연월'] = '2019-12'

In [113]:
sample_2

  국적코드  성별    입국객수     기준연월
0  A01  남성   92556  2019-12
1  A01  여성  163737  2019-12
2  A18  남성  155540  2019-12
3  A18  여성  249023  2019-12

In [114]:
sample_1.append(sample_2)

C:\Users\admin\AppData\Local\Temp\ipykernel_15848\2779293832.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  sample_1.append(sample_2)

  국적코드  성별    입국객수     기준연월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11
0  A01  남성   92556  2019-12
1  A01  여성  163737  2019-12
2  A18  남성  155540  2019-12
3  A18  여성  249023  2019-12

In [122]:
sample_total = pd.concat([sample_1,sample_2], ignore_index=True)

저장하기 / file : sample.xlsx

In [121]:
sample_total.to_excel('C:/Study/Study_Python2/파이썬/files/sample.xlsx', index=False)

sample 파일 총 24개를 읽어들여서 sample_total 데이터 프레임에 합쳐서 넣기

In [ ]:
# 최종 컬럼 : 국적코드, 성별, 입국객수, 기준연월, 국적명
# sample_total 조회
# 기준연월 : 각 파일당 2019년 01월 ~ 2020년 12월 값 사용

# 총 데이터 합의 수 계산(검증) : 1개 파일의 행의수 x 24파일

In [55]:
for yyyy in range(2019,2021,1):
    for mm in range(1,13,1):
        print(str(yyyy)+'-'+str(mm).zfill(2))

2019-01
2019-02
2019-03
2019-04
2019-05
2019-06
2019-07
2019-08
2019-09
2019-10
2019-11
2019-12
2020-01
2020-02
2020-03
2020-04
2020-05
2020-06
2020-07
2020-08
2020-09
2020-10
2020-11
2020-12

In [58]:
code_master2 = pd.read_excel('./files2/sample_codemaster.xlsx')
i = 0
sample_total = pd.DataFrame()

for yyyy in range(2019,2021,1):
    for mm in range(1,13,1):
        #print(str(yyyy)+'-'+str(mm).zfill(2))

        file_path = './files2/sample({}).xlsx'.format(i)
        sample2 = pd.read_excel(file_path, header=1, skipfooter=2, usecols='A:C')
        i += 1
        sample2['기준년월'] =  str(yyyy)+'-'+str(mm).zfill(2)
        sample_end = pd.merge(left=sample2,
                              right= code_master2,
                              how= 'left',
                              left_on= '국적코드',
                              right_on= '국적코드')
        sample_total = pd.concat([sample_total, sample_end], ignore_index=True)

print(len(sample_total))
sample_total

144

    국적코드  성별    입국객수     기준년월  국적명
0    A01  남성  106320  2019-01   일본
1    A01  여성  191436  2019-01   일본
2    A31  남성     319  2019-01  NaN
3    A31  여성      42  2019-01  NaN
4    A18  남성  158912  2019-01   중국
..   ...  ..     ...      ...  ...
139  A01  여성  191436  2020-12   일본
140  A31  남성     319  2020-12  NaN
141  A31  여성      42  2020-12  NaN
142  A18  남성  158912  2020-12   중국
143  A18  여성  232943  2020-12   중국

[144 rows x 5 columns]

In [43]:
import os
path = './files2/'
sample_total = pd.DataFrame()
file_list = os.listdir(path)
file_list_py = [file for file in file_list if 'sample_codemaster.xlsx' not in file]

In [44]:
sample_total = pd.DataFrame()
for i in file_list_py : 
    data = pd.read_excel(path + i)
    sample_total = pd.concat([sample_total, data])
sample_total = sample_total.reset_index(drop=True)

In [2]:
os.getcwd()

'c:\\Study\\Study_Python2\\파이썬\\2day_판다스 기초'

In [131]:
import os
os.getcwd()
path = './files2/'
file_list = os.listdir(path)
file_list_py = [file for file in file_list if file.endswith('.xlsx')]

In [128]:
sample_total = pd.DataFrame()
for i in file_list_py : 
    data = pd.read_excel(path + i)
    sample_total = pd.concat([sample_total, data])
sample_total = sample_total.reset_index(drop=True)